'use strict';

// 1 Какое будет выведено значение: let x = 5; alert( x++ ); ? => 5
// 2 Чему равно такое выражение: [ ] + false - null + true ? => NaN
// 3 Что выведет этот код: let y = 1; let x = y = 2; alert(x); ? => 2 
// 4 Чему равна сумма [ ] + 1 + 2? => 12
// 5 Что выведет этот код: alert( "1"[0] )? => 1
// 6 Чему равно 2 && 1 && null && 0 && undefined ? => null
// 7 Есть ли разница между выражениями? !!( a && b ) и (a && b)? => NOPE
// 8 Что выведет этот код: alert( null || 2 && 3 || 4 ); ? => 3 потому что && вернет 3 а 3 или 4 вернет первый true элемент
// 9 a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ? => NOPE
// 10 Что выведет этот код: alert( +"Infinity" ); ? унарный плюс приведет строку к значению  Infinty
// 11 Верно ли сравнение: "Ёжик" > "яблоко"? => Nope
// 12 Чему равно 0 || "" || 2 || undefined || true || falsе ? => 2
